---
kind: type
id: T:Autodesk.Revit.DB.GeomCombination
source: html/75501cfa-a83b-0acf-c446-b368551da6c4.htm
---
# Autodesk.Revit.DB.GeomCombination

An element created by Join and Cut operations applied to combinable elements in an Autodesk Revit family document.

## Syntax (C#)
```csharp
public class GeomCombination : CombinableElement
```